In [1]:
import pandas as pd
# Cria um DataFrame
data = {'Empresa':['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
       'Nome': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
       'Venda':[200, 120, 340, 124, 243, 250]}

In [2]:
data

{'Empresa': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Nome': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Venda': [200, 120, 340, 124, 243, 250]}

In [14]:
 df = pd.DataFrame(data)
df

  Empresa     Nome  Venda
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    250

In [15]:
group = df.groupby('Empresa')
group

In [16]:
group.sum() #Total de vendas por empresa
group.mean() #Media

         Venda
Empresa
FB       246.5
GOOG     160.0
MSFT     232.0

In [17]:
group.describe()

        Venda
        count   mean         std    min     25%    50%     75%    max
Empresa
FB        2.0  246.5    4.949747  243.0  244.75  246.5  248.25  250.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [20]:
group = df.groupby('Nome')

In [21]:
group.sum()

         Venda
Nome
Amy        340
Carl       243
Charlie    120
Sam        200
Sarah      250
Vanessa    124

In [23]:
group.sum().loc['Amy']

Venda    340
Name: Amy, dtype: int64